package ru.java.practice.firstlesson;

//3. Вывести на экран слово “JAVA”, столбик, чтобы оно повторилось 10 раз, используя цикл на ваше усмотрение (for или while).
//    Вывод в консоль должен быть таким:
//    JAVA
//    JAVA
//    JAVA
//    JAVA
//    JAVA
//    JAVA
//    JAVA
//    JAVA
//    JAVA
//    JAVA
public class ThirdTask {
    public static void main(String[] args) {
        for (int i = 0; i < 10; i++) {
            System.out.println("JAVA");
        }
    }
}
